---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.PartStatus
source: html/d1ec2d76-1134-6a89-fa80-af4689e5867b.htm
---
# Autodesk.Revit.DB.FabricationPart.PartStatus Property

The status identifier for the fabrication part.

## Syntax (C#)
```csharp
public int PartStatus { get; set; }
```